Repository: TomHardman/Logic-Simulator
Catalog: logsim/locales/*/LC_MESSAGES/translate.po
Languages: de_de

source: Light
de_de: Hell

source: About
de_de: Über

source: Dark
de_de: Dunkel

source: &Exit
de_de: &Beenden

source: &Theme
de_de: &FarbThema

source: &Save Circuit
de_de: &Schaltung speichern

source: &Load Circuit
de_de: &Schaltung laden

source: &Menu
de_de: &Menü

source: Cycles:
de_de: Zyklen:

source: Run
de_de: Ausführen

source: Animate
de_de: Animieren

source: Cycles Completed
de_de: Zyklen abgeschlossen

source: Monitor Configuration:
de_de: Monitor-Konfiguration:

source: Add/Zap Monitors
de_de: Hinzufügen/ zappen

source: Change Trace Colours
de_de: Spurfarben ändern

source: Device Configuration:
de_de: Geräte-Konfiguration:

source: Add Device
de_de: Gerät hinzufügen

source: Add Connections
de_de: Verbindungen hinzufügen

source: Logic Simulator Created by bd432, al2008, th624 2023
de_de: Logiksimulator Erstellt von bd432, al2008, th624 2023

source: About Logsim
de_de: Über Logsim

source: Choose a file location
de_de: Wählen Sie einen Dateispeicherort

source: Choose a file to load
de_de: Wählen Sie eine Datei zum Laden

source: Circuit file must be .txt
de_de: Die Schaltungsdatei muss .txt sein

source: Circuit could not be loaded from file
de_de: Die Schaltung konnte nicht aus der Datei geladen werden

source: Finish adding connections before trying to execute another action
de_de: Beenden Sie das Hinzufügen von Verbindungen, bevor Sie eine andere Aktion ausführen

source: Finish adding/zapping monitors before trying to execute another action
de_de: Beenden Sie das Hinzufügen/Löschen von Monitoren, bevor Sie eine andere Aktion ausführen

source: End animation before trying to execute another action
de_de: Beenden Sie die Animation, bevor Sie eine andere Aktion ausführen

source: Run failed to execute - network oscillating
de_de: Die Ausführung des Programms ist fehlgeschlagen - Das Netzwerk schwingt

source: Run failed to execute - make sure all devices are connected
de_de: Die Ausführung des Programms ist fehlgeschlagen - Stellen Sie sicher, dass alle Geräte verbunden sind

source: Continue
de_de: Weitermachen

source: Please select valid number of cycles greater than zero
de_de: Bitte wählen Sie eine gültige Anzahl von Zyklen größer als Null

source: Device Menu
de_de: Geräte-Menü

source: Choose Device:
de_de: Gerät wählen:

source: Enter half period:
de_de: Geben Sie die halbe Periode ein:

source: Enter time til drop off:
de_de: Geben Sie die Zeit bis zum Ausschalten ein:

source: Enter signal sequence:
de_de: Geben Sie die Signalsequenz ein:

source: Enter initial switch state:
de_de: Geben Sie den anfänglichen Schaltzustand ein:

source: Enter number of inputs:
de_de: Geben Sie die Anzahl der Eingänge ein:

source: Confirm
de_de: Bestätigen

source: Device chosen
de_de: Gerät gewählt

source: Back
de_de: Zurück

source: Half Period:
de_de: Halbe Periode:

source: Number of inputs:
de_de: Anzahl der Eingänge:

source: Initial State:
de_de: Anfangszustand:

source: Time til dropoff:
de_de: Zeit bis zum Ausschalten:

source: Signal Sequence:
de_de: Signalsequenz:

source: Enter device name:
de_de: Geben Sie den Gerätenamen ein:

source: SIGGEN signal must be a sequence of 1s and 0s
de_de: Das SIGGEN-Signal muss eine Sequenz von 1en und 0en sein

source: Please enter a valid name
de_de: Bitte geben Sie einen gültigen Namen ein

source: Error
de_de: Fehler

source: Warning
de_de: Warnung

source: Changing language will reset the circuit canvas and any devices that have been repositioned will be reset to their default positions. Are you sure you want to continue?
de_de: Durch Ändern der Sprache wird die Schaltungsoberfläche zurückgesetzt und Alle Geräte, die neu positioniert wurden, werden auf ihre Position zurückgesetzt Standardpositionen. Bist du dir sicher, dass du weitermachen willst?
